<a href="https://colab.research.google.com/github/codewithswatiee/DS-AI-ML/blob/main/DataCleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('/content/googleplaystore.csv')

## Deleting col with missing data

In [5]:
df1 = df.copy()

In [6]:
df1.isna().sum()

App                  0
Category             0
Rating            1474
Reviews              0
Size                 0
Installs             0
Type                 1
Price                0
Content Rating       1
Genres               0
Last Updated         0
Current Ver          8
Android Ver          3
dtype: int64

In [7]:
df1.drop('Rating', axis=1, inplace = True) #not a good option as we completely lost the column.

In [8]:
df1.isna().sum()

App               0
Category          0
Reviews           0
Size              0
Installs          0
Type              1
Price             0
Content Rating    1
Genres            0
Last Updated      0
Current Ver       8
Android Ver       3
dtype: int64

## Deleting row with missing data

In [9]:
df2 = df.copy()

In [10]:
df2.dropna(inplace=True)

In [11]:
df2.shape

(9360, 13)

## Filling Missing value

Numeric

In [12]:
df3 = df.copy()

In [13]:
df3['Rating'].fillna(df3['Rating'].mean())

0        4.100000
1        3.900000
2        4.700000
3        4.500000
4        4.300000
           ...
10836    4.500000
10837    5.000000
10838    4.193338
10839    4.500000
10840    4.500000
Name: Rating, Length: 10841, dtype: float64

Categorical

In [21]:
df3['Type'].fillna(df3['Type'].mode()[0], inplace=True)

<ipython-input-21-0b19745ea44b>:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df3['Type'].fillna(df3['Type'].mode()[0], inplace=True)

In [22]:
df3['Type'].isna().sum()

np.int64(0)

In [23]:
df4 = df.copy()

In [24]:
df4.isna().sum()

App                  0
Category             0
Rating            1474
Reviews              0
Size                 0
Installs             0
Type                 1
Price                0
Content Rating       1
Genres               0
Last Updated         0
Current Ver          8
Android Ver          3
dtype: int64

In [25]:
df4["Type"].fillna("No_Type", inplace=True)

<ipython-input-25-646f8ed27398>:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df4["Type"].fillna("No_Type", inplace=True)

In [28]:
(df4['Type'] == 'No_Type').sum()

np.int64(1)

## Advance Imputation

In [29]:
df5 = df.copy()

In [30]:
df5['Rating'].interpolate(inplace=True)

<ipython-input-30-58bbec27708b>:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df5['Rating'].interpolate(inplace=True)

In [32]:
df5['Rating'].head(20)

0     4.1
1     3.9
2     4.7
3     4.5
4     4.3
5     4.4
6     3.8
7     4.1
8     4.4
9     4.7
10    4.4
11    4.4
12    4.2
13    4.6
14    4.4
15    3.2
16    4.7
17    4.5
18    4.3
19    4.6
Name: Rating, dtype: float64